# 01- How to find the version?

In [ ]:
import pandas as pd
pd.__version__

In [ ]:
# another way
pd.show_versions()

# 02- Make a Datafram

In [ ]:
df = pd.DataFrame({"A col": [1, 2, 3], "B col": [4, 5, 6]})
df.head()

In [ ]:
# numpy array use to create dataFrame
import numpy as np

arr = np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
pd.DataFrame(arr)

In [ ]:
# numpy array dataFrame
pd.DataFrame(np.random.rand(2,6), columns=list('ABCDEF'))

# 03- How to rename columns?

In [ ]:
df = pd.DataFrame({"A col": [1, 2, 3], "B col": [4, 5, 6]})
df.rename(columns={'A col': 'A', 'B col': 'B'}, inplace=True)
print(df)

In [ ]:
# rename columns
df.columns=['col_aa', 'col_bb']
df

In [ ]:
# to replace any character, string
df.columns = df.columns.str.replace('_','-')
df

In [ ]:
df = df.add_prefix('test_')
df

In [ ]:
df = df.add_suffix('_test')
df

In [ ]:
df.columns = ['col-a', 'col-b']
df

# 04- Using Template Data

In [ ]:
import pandas as pd
import seaborn as sns
import numpy as np

df = sns.load_dataset('titanic')
df.info()

In [ ]:
df.to_csv("../files/titanic.csv")
df.to_excel("../files/titanic.xlsx")

# 05- Using your own data

In [ ]:
import pandas as pd
df = pd.read_csv("../files/titanic.csv")
df

# 06- Reverse Row Order

In [ ]:
import seaborn as sns
import pandas as pd

df = sns.load_dataset("titanic")
df = df.loc[::-1] #reverse row order
df = df.reset_index(drop=True) #reset index
df

# 07- Reverse Column Order

In [ ]:
df.loc[:, ::-1].head()

# 08- select a column by dtype

In [ ]:
# get all data frames column dtypes
df.dtypes

In [ ]:
# only select those have numeric type
df.select_dtypes(include=['number']).head()

In [ ]:
# only select those have object
df.select_dtypes(include=['object']).head()

In [ ]:
# exclude column type
df.select_dtypes(exclude=['number', 'object']).head()

# 09- Convert strings to number

In [ ]:
df = pd.DataFrame(
    {"col_a": [1, 2, 3, 4, 5, 6, 7, 8, 9], "col_b": [10, 11, 12, 13, 14, 15, 16, 17, 18]}
)
df

In [ ]:
# method 1
df.astype({'col_a': 'int64', 'col_b': 'int64'}).dtypes

In [ ]:
# method 2
pd.to_numeric(df['col_a'], errors='coerce')
df.dtypes

# 10- Reduce dataframe size

In [ ]:
df = sns.load_dataset('titanic')
df.shape

In [ ]:
df.info(memory_usage='deep')

In [ ]:
df.sample(frac=0.1).shape
df.info()

# 11- Copy data from clip board

In [ ]:
# dataset download
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.to_excel("../files/titanic.xlsx")

In [ ]:
# read clipboard in python
df = pd.read_clipboard()
df

# 12-  split database into two subsets

In [ ]:
# dataset download
import pandas as pd
import seaborn as sns

df = sns.load_dataset('titanic')
df.head()

In [ ]:
df.shape

In [ ]:
kashti_1 = df.sample(frac=0.5, random_state=1)
kashti_1.shape

In [ ]:
kashti_2 = df.drop(kashti_1.index)
kashti_2.shape

# 13- Join two datasets

In [ ]:
df1= kashti_1._append(kashti_2)
df1.shape

# 14- Filtering a dataset

In [ ]:
df.head()

In [ ]:
df.sex.unique()

In [ ]:
# filter by column values
df[df.sex == 'female']

In [ ]:
df.pclass.unique()

In [ ]:
df[((df.embark_town == 'Southampton') | (df.embark_town == 'Cherbourg')) & (df.alive == 'yes')]

In [ ]:
df[df.embark_town.isin(['Cherbourg', 'Southampton'])]

# 15- Filtering by large categories

In [ ]:
df.embark_town.value_counts()
df.embark_town.value_counts().nlargest()

In [ ]:
df[(df.embark_town.isin(df.embark_town.value_counts().nlargest(1).index)) & df.who.isin(['man'])].shape

# 16- Splitting a string into multiple columns

In [ ]:
import pandas as pd

df = pd.DataFrame({
    'name': ['Abdul Basit', 'Muhammad Uzair', 'Muhammad Affan'],
    'location': ['Garden, Karachi, Pakistan', 'Hyderabad, Karachi, Pakistan', 'XYZ, Humburg, Germany']
})

df

In [ ]:
df[["first_name", "last_name"]] = df.name.str.split(' ', expand=True)
df

In [ ]:
df[["area", "city", "country"]] = df.location.str.split(', ', expand=True)
df

In [ ]:
# Refine data manipulation
df = df[['first_name', 'last_name', 'area', 'city', 'country']]
df

# 17- Aggregate by multiple groups/function

In [ ]:
import pandas as pd
import seaborn as sns

df = sns.load_dataset("titanic")
df.head()

In [ ]:
df.groupby('who').count()
df.groupby('sex').count()

In [ ]:
df.groupby('sex').sum(numeric_only=True)

In [ ]:
len(df.groupby('sex'))

In [ ]:
df.groupby(['sex','embark_town','alive']).count()

# 18- select specific rows or column

In [131]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [ ]:
# select columns
df[['sex', 'class']]

In [135]:
# select rows
df.describe().loc[['min', '25%', '50%', '75%', 'max']]
# or
df.describe().loc['min':'max']

     survived  pclass     age  sibsp  parch      fare
min       0.0     1.0   0.420    0.0    0.0    0.0000
25%       0.0     2.0  20.125    0.0    0.0    7.9104
50%       0.0     3.0  28.000    0.0    0.0   14.4542
75%       1.0     3.0  38.000    1.0    0.0   31.0000
max       1.0     3.0  80.000    8.0    6.0  512.3292

In [137]:
# select rows and columns
df.describe().loc['min':'max', 'survived':'age']

     survived  pclass     age
min       0.0     1.0   0.420
25%       0.0     2.0  20.125
50%       0.0     3.0  28.000
75%       1.0     3.0  38.000
max       1.0     3.0  80.000

# 19- Reshape multiindex series

In [138]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [141]:
df.survived.mean()

0.3838383838383838

In [162]:
df.groupby('sex').survived.mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

# 20- Continuous to catogirical data conversion

In [163]:
df.age.head()

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
Name: age, dtype: float64

In [166]:
df['age_bin'] = pd.cut(df['age'], bins=[0,18,24,99], labels=['child', 'adult', 'young'])
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_bin
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,adult
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,young
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,young
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,young
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,young